#include <GL/glut.h> ///貼上上周的10行程式碼
///貼上剛剛的week02_glut_color_teapot
void display()
{
    glColor3f(235/255.0, 51/255.0 , 36/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///1
        glVertex2f((150-200)/200.0,-(61-200)/200.0);
        glVertex2f((131-200)/200.0,-(80-200)/200.0);
        glVertex2f((195-200)/200.0,-(101-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(209/255.0, 45/255.0 , 32/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///2
        glVertex2f((150-200)/200.0,-(61-200)/200.0);
        glVertex2f((131-200)/200.0,-(80-200)/200.0);
        glVertex2f((80-200)/200.0,-(67-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(153/255.0, 10/255.0 , 7/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///3
        glVertex2f((80-200)/200.0,-(67-200)/200.0);
        glVertex2f((125-200)/200.0,-(130-200)/200.0);
        glVertex2f((131-200)/200.0,-(80-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(204/255.0, 52/255.0 , 22/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///4
        glVertex2f((131-200)/200.0,-(80-200)/200.0);
        glVertex2f((125-200)/200.0,-(130-200)/200.0);
        glVertex2f((162-200)/200.0,-(127-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(209/255.0, 64/255.0 , 53/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///5
        glVertex2f((131-200)/200.0,-(80-200)/200.0);
        glVertex2f((162-200)/200.0,-(127-200)/200.0);
        glVertex2f((195-200)/200.0,-(101-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(235/255.0, 51/255.0 , 36/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///6
        glVertex2f((80-200)/200.0,-(68-200)/200.0);
        glVertex2f((38-200)/200.0,-(111-200)/200.0);
        glVertex2f((124-200)/200.0,-(130-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(242/255.0, 70/255.0 , 47/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///7
        glVertex2f((38-200)/200.0,-(111-200)/200.0);
        glVertex2f((77-200)/200.0,-(149-200)/200.0);
        glVertex2f((124-200)/200.0,-(130-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(173/255.0, 58/255.0 , 43/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///8
        glVertex2f((38-200)/200.0,-(111-200)/200.0);
        glVertex2f((39-200)/200.0,-(176-200)/200.0);
        glVertex2f((77-200)/200.0,-(149-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(219/255.0, 56/255.0 , 34/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///9
        glVertex2f((77-200)/200.0,-(149-200)/200.0);
        glVertex2f((39-200)/200.0,-(176-200)/200.0);
        glVertex2f((79-200)/200.0,-(223-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(240/255.0, 102/255.0 , 102/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///10
        glVertex2f((77-200)/200.0,-(149-200)/200.0);
        glVertex2f((138-200)/200.0,-(166-200)/200.0);
        glVertex2f((79-200)/200.0,-(223-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(219/255.0, 56/255.0 , 34/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///11
        glVertex2f((77-200)/200.0,-(149-200)/200.0);
        glVertex2f((138-200)/200.0,-(166-200)/200.0);
        glVertex2f((125-200)/200.0,-(130-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(179/255.0, 29/255.0 , 26/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///12
        glVertex2f((125-200)/200.0,-(130-200)/200.0);
        glVertex2f((138-200)/200.0,-(166-200)/200.0);
        glVertex2f((162-200)/200.0,-(127-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(217/255.0, 58/255.0 , 46/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///13
        glVertex2f((162-200)/200.0,-(127-200)/200.0);
        glVertex2f((138-200)/200.0,-(166-200)/200.0);
        glVertex2f((223-200)/200.0,-(160-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(184/255.0, 54/255.0 , 37/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///14
        glVertex2f((162-200)/200.0,-(127-200)/200.0);
        glVertex2f((195-200)/200.0,-(101-200)/200.0);
        glVertex2f((223-200)/200.0,-(160-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(212/255.0, 27/255.0 , 27/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///15
        glVertex2f((138-200)/200.0,-(166-200)/200.0);
        glVertex2f((79-200)/200.0,-(223-200)/200.0);
        glVertex2f((150-200)/200.0,-(261-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(222/255.0, 75/255.0 , 64/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///16
        glVertex2f((138-200)/200.0,-(166-200)/200.0);
        glVertex2f((223-200)/200.0,-(160-200)/200.0);
        glVertex2f((150-200)/200.0,-(261-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(184/255.0, 62/255.0 , 53/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///17
        glVertex2f((79-200)/200.0,-(223-200)/200.0);
        glVertex2f((150-200)/200.0,-(261-200)/200.0);
        glVertex2f((153-200)/200.0,-(296-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(191/255.0, 44/255.0 , 19/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///18
        glVertex2f((223-200)/200.0,-(160-200)/200.0);
        glVertex2f((150-200)/200.0,-(261-200)/200.0);
        glVertex2f((243-200)/200.0,-(273-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(168/255.0, 38/255.0 , 17/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///19
        glVertex2f((150-200)/200.0,-(261-200)/200.0);
        glVertex2f((177-200)/200.0,-(303-200)/200.0);
        glVertex2f((243-200)/200.0,-(273-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(138/255.0, 26/255.0 , 17/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///20
        glVertex2f((150-200)/200.0,-(261-200)/200.0);
        glVertex2f((153-200)/200.0,-(296-200)/200.0);
        glVertex2f((198-200)/200.0,-(335-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(181/255.0, 56/255.0 , 39/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///21
        glVertex2f((177-200)/200.0,-(303-200)/200.0);
        glVertex2f((243-200)/200.0,-(273-200)/200.0);
        glVertex2f((198-200)/200.0,-(335-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(217/255.0, 58/255.0 , 46/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///22
        glVertex2f((277-200)/200.0,-(224-200)/200.0);
        glVertex2f((243-200)/200.0,-(273-200)/200.0);
        glVertex2f((223-200)/200.0,-(160-200)/200.0);
    glEnd(); ///結束畫

    glColor3f(222/255.0, 75/255.0 , 64/255.0);
    glBegin(GL_POLYGON); ///開始畫多邊形 ///23
        glVertex2f((198-200)/200.0,-(335-200)/200.0);
        glVertex2f((243-200)/200.0,-(273-200)/200.0);
        glVertex2f((324-200)/200.0,-(221-200)/200.0);
    glEnd(); ///結束畫

    glutSwapBuffers();
}

int main(int argc, char *argv[])
{
    glutInit(&argc, argv);
    glutInitDisplayMode(GLUT_RGB | GLUT_DOUBLE | GLUT_DEPTH);
    glutCreateWindow("week02_glut_homework");
    glutDisplayFunc(display);

    glutMainLoop();
}
